# -*- encoding : utf-8 -*-
# ဟင်းချက်စရာ မှာခြင်း
# တွက်ချက်ခြင်းကို ဆောင်ရွက်ပေးသည့် ပရိုဂရမ်
# encoding: utf-8

require './bဈေးတွက်'

@ကြက်သားတစ်ပိသာ = တန်ဖိုး(:၃၅၀၀)
@စျေးနှုန်း = {
	"ဆန်" =>တန်ဖိုး(:၂၀၀၀), 
	"ဆီ" => တန်ဖိုး(:၂၀၀), 
	"ဆား" => တန်ဖိုး(:၂၀၀)
	}
@ရှိငွေ = တန်ဖိုး(ARGV[0]) || တန်ဖိုး(:၁၀၀၀)
@လက်ကျန်ငွေ = @ရှိငွေ - @စျေးနှုန်း.တန်ဖိုးအားလုံးပေါင်း

def ပြောလိုက်သည်မှာ
	ရေး "ပြော −− ကန်ဇွန်းရွက်တစ်စည်းပေးပါခင်ဗျာ" if @လက်ကျန်ငွေ < @ကြက်သားတစ်ပိသာ
	ရေး "ပြော −− ကြက်သား တစ်ပိသာ ထည့်လိုက်စမ်း!!" if @လက်ကျန်ငွေ > @ကြက်သားတစ်ပိသာ
end

ရေး "စိတ်ထဲတွင် −− ဒီတစ်ပါတ်အတွက် ငွေ #{စာ(@စျေးနှုန်း.တန်ဖိုးအားလုံးပေါင်း)} ရှိမှ လောက်မယ်။"
ရေး "စိတ်ထဲတွင် −− အိတ်ထဲမှာ #{စာ(@ရှိငွေ)} ပါတယ်။"
ရေး "စိတ်ထဲတွင် −− ဟိုက် ငတ်ပြီ။" if @ရှိငွေ < @စျေးနှုန်း.တန်ဖိုးအားလုံးပေါင်း
ရေး "စိတ်ထဲတွင် -- ဆန်၊ဆီ၊ဆား ဝယ်ပြီးရင် #{စာ(@လက်ကျန်ငွေ)} ကျန်သေးတာပဲ။" if @ရှိငွေ > @စျေးနှုန်း.တန်ဖိုးအားလုံးပေါင်း

ပြောလိုက်သည်မှာ unless @လက်ကျန်ငွေ < 0
